# DATA CLEANING

### import modules and libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### import dataset

In [2]:
data = pd.read_csv('../dataSet/car_data.csv')
data.tail(10)

,name,price,year,mileage,engine,transmission
157498,PORSCHE CAYENNE,"£84,975",2019,"26,511 miles",Hybrid,Automatic
157499,BMW X7,"£84,985",2023,"28,787 miles",Hybrid,Semiauto
157500,Land Rover Range Rover,"£84,989",2023,"10,708 miles",Diesel,Automatic
157501,Audi RS Q8,"£84,990",2020,"13,181 miles",Petrol,Semiauto
157502,Audi Q7,"£84,990",2024,"5,401 miles",Petrol,Semiauto
157503,Audi SQ8,"£84,990",2024,"1,000 miles",Petrol,Semiauto
157504,Land Rover Range Rover Estate,"£84,990",2022,"31,482 miles",Petrol,Automatic
157505,BMW X7,"£84,990",2024,"7,639 miles",Diesel,Semiauto
157506,Volkswagen Grand California,"£84,995",2024,20 miles,Diesel,Semiauto
157507,MERCEDES-BENZ S-CLASS,"£84,995",2022,"32,000 miles",Hybrid,Automatic

The car features are names of the car, price of the car, production year, miles travelled, engine and transmission types

### get the shape of the data

In [3]:
data.shape

(157508, 6)

### get the statistical description of the float columns

In [4]:
data.describe()

                       name    price    year      mileage  engine transmission
count                157508   157508  157508       157508  157508       156060
unique                 2423    15678      76        23627      33           18
top     Land Rover Defender  £50,000    2024  5,000 miles  Petrol    Automatic
freq                   7351      986   48611         2158   66804        76486

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 157508 entries, 0 to 157507
Data columns (total 6 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   name          157508 non-null  object
 1   price         157508 non-null  object
 2   year          157508 non-null  object
 3   mileage       157508 non-null  object
 4   engine        157508 non-null  object
 5   transmission  156060 non-null  object
dtypes: object(6)
memory usage: 7.2+ MB

In [6]:
data.isnull().sum()

name               0
price              0
year               0
mileage            0
engine             0
transmission    1448
dtype: int64

There are some missing values in the transmission column.which is a very small number so we need to check the column to see how we can clean it

In [7]:
data[data['transmission'].isnull()]

,name,price,year,mileage,engine,transmission
7380,Renault Megane,"£5,295",2017,"133,203 miles",Manual,NaN
7381,Volkswagen Passat,"£5,295",2017,"133,203 miles",Manual,NaN
7382,Hyundai i10,"£5,295",2017,"133,203 miles",Manual,NaN
7383,FORD FIESTA,"£5,295",2017,"133,203 miles",Manual,NaN
7384,Ford S-Max,"£5,295",2017,"133,203 miles",Manual,NaN
...,...,...,...,...,...,...
144071,BMW i5,"£75,000",10 miles,Electric,Automatic,NaN
144090,BMW i5,"£75,000",10 miles,Electric,Automatic,NaN
145510,Ferrari California,"£76,995","28,900 miles",Petrol,Automatic,NaN
156534,Bentley Bentayga,"£84,995","14,600 miles",Diesel,Automatic,NaN
156545,BMW iX,"£85,000","2,500 miles",Electric,Automatic,NaN

The rows with null values are small and look inconsistent, so it is best we delete it

In [8]:
data= data.dropna()
data.shape

(156060, 6)

about 1450 rows have been deleted which is less than 1% of the total data

In [9]:
#delete duplicate rows 
data = data.drop_duplicates(keep= 'first', inplace=False)

In [10]:
data.shape

(66807, 6)

## NAME

We will extract the name of the car manufacturers from the name column

In [11]:
# Remove white spaces from the column names
data.columns = data.columns.str.strip()

# Set the manufacturer column to uppercase and handle 'LAND ROVER' separately
data['manufacturer'] = data['name'].apply(lambda x: 'LAND ROVER' if 'LAND ROVER' in x.upper() else x.split(' ')[0].upper())

# Keep just the first letter of each word in the 'name' column in uppercase
data['name'] = data['name'].str.title()

data['manufacturer'].head()
data['name'].head()

0        Ford Fiesta
1     Vauxhall Corsa
2    Vauxhall Zafira
3        Peugeot 107
4     Vauxhall Corsa
Name: name, dtype: object

show the number of unique manufacturers

In [12]:
data.manufacturer.nunique()

71

We will clean these data by making similar maufacturers uniform.

In [13]:
marks =data.manufacturer.unique()
print(marks)

['FORD' 'VAUXHALL' 'PEUGEOT' 'BMW' 'HONDA' 'MAZDA' 'KIA' 'VOLKSWAGEN'
 'NISSAN' 'RENAULT' 'FIAT' 'AUDI' 'CITROEN' 'VOLVO' 'SUZUKI' 'JAGUAR'
 'TOYOTA' 'SEAT' 'DACIA' 'MINI' 'SKODA' 'DAIHATSU' 'HYUNDAI'
 'MERCEDES-BENZ' 'SUBARU' 'LAND ROVER' 'SAAB' 'MERCEDES' 'ALFA'
 'CHEVROLET' 'MITSUBISHI' 'SMART' 'LEXUS' 'DODGE' 'CHRYSLER' 'SSANGYONG'
 'JEEP' 'MG' 'DS' 'ROVER' 'IVECO' 'PORSCHE' 'GREAT' 'ABARTH' 'INFINITI'
 'TRIUMPH' 'ISUZU' 'MASERATI' 'MAXUS' 'LDV' 'TESLA' 'LEVC' 'BENTLEY' 'MAN'
 'POLESTAR' 'CUPRA' 'LOTUS' 'CATERHAM' 'KGM' 'ROLLS-ROYCE' 'GENESIS'
 'ASTON' 'MORGAN' 'HUMMER' 'SMARTUK' 'ALPINE' 'MAYBACH' 'INEOS' 'FERRARI'
 'MCLAREN' 'ROLLS']

## PRICE

format the price to valuse without currency

In [14]:
# Remove non-numeric characters and convert to integer
data['price'] = data['price'].str.replace(',', '').str.replace('£', '').str.extract('(\d+)').astype(np.int64)
print(data['price'].head())
print(data['price'].tail())

0    1500
1    1500
2    1500
3    1500
4    1500
Name: price, dtype: int64
156542    84995
156543    84995
156544    84999
156546    85000
156547    85000
Name: price, dtype: int64

## YEAR

we have to convert year into age so it will be easy interpret by our model

In [15]:
#convert the year column to integer
data['year']=data['year'].astype(str).astype(np.int64)

In [19]:
data['age'] = 2025 - data['year']

In [20]:
data['age'] = data['age'].astype(np.int64)

### Remove rows with negative age

In [ ]:
print(data.shape)
data['age'].tail()
data = data[data['age'] >= 0]
print(data.shape)

(66807, 8)
(66806, 8)

### mileage to kilomiterage

Remove the commas and miles from the mileage column , convert it to kilomiterage

In [ ]:
# Remove commas, spaces, and 'miles' from the mileage column and convert to integer
data['mileage'] = data['mileage'].str.replace(',', '').str.replace(' ', '').str.replace('miles', '').astype(np.int64)

# Convert mileage to kilometerage
data['mileage'] = (data['mileage'] * 1.60934).astype(np.int64)

# Rename the column to 'kilometerage'
data.rename(columns={'mileage': 'kilometerage'}, inplace=True)

data['kilometerage'].tail()

156541     4184
156542     3057
156544    45061
156546    12824
156547     7903
Name: kilometerage, dtype: int64

## ENGINE

In [22]:
# remove spaces
data['engine'] = data['engine'].str.strip()
data['engine'].unique()

array(['Petrol', 'Diesel', 'Electric', 'Petrol hybrid', 'Petrol/electric',
       'Hybrid', 'Petrol plug-in hybri', 'Hybrid electric',
       'Petrol/electric hybr', 'Petrol/mhev', 'Plug-in hybrid',
       'Electric diesel', 'Electric only', 'Petrol series phev',
       'Diesel hybrid', 'Petrol parallel phev', 'Petrol/plugin elec h',
       'Petrol / electric hy', 'Diesel/mhev', 'Petrol/plugin e',
       'Unleaded', 'Diesel/electric hybr', 'Diesel plug-in hybri', 'N/a',
       'Petrol plug-in', 'Diesel/plugin e', 'Bi fuel',
       'Diesel parallel phev', 'Diesel / electric hy',
       'Diesel/plugin elec h'], dtype=object)

In [23]:
data = data.replace({'engine' : 
                        {'Petrol hybrid': 'Hybrid','Petrol hybrid': 'Hybrid', 
                        'Petrol / electric hy' : 'Hybrid','Petrol plug-in hybri': 'Plug_in_hybrid',
                        'Hybrid electric': 'Hybrid','Petrol/electric hybr': 'Hybrid',
                        'Petrol/mhev': 'Hybrid','Plug-in hybrid': 'Plug_in_hybrid',
                        'Electric diesel': 'Hybrid','Electric only': 'Electric',
                        'Petrol series phev': 'Hybrid','Diesel hybrid':'Hybrid',
                        'Petrol parallel phev': 'Hybrid', 'Petrol/plugin elec h': 'Hybrid',
                        'Petrol / electric hy': 'Hybrid', 'Diesel/mhev': 'Hybrid', 'Petrol/plugin e': 'Plug_in_hybrid',
                        'Diesel/electric hybr': 'Hybrid', 'Diesel plug-in hybri': 'Plug_in_hybrid',
                        'Petrol plug-in': 'Plug_in_hybrid', 'Diesel/plugin e': 'Plug_in_hybrid',
                        'Diesel parallel phev': 'Hybrid', 'Diesel / electric hy': 'Hybrid',
                        'Diesel/plugin elec h': 'Plug_in_hybrid', 'Electric / petrol': 'Hybrid', 'Electric / diesel': 'Hybrid',   
                        'Petrol/electric' : 'Hybrid'}
                     })
data['engine'].unique()

array(['Petrol', 'Diesel', 'Electric', 'Hybrid', 'Plug_in_hybrid',
       'Unleaded', 'N/a', 'Bi fuel'], dtype=object)

Remove rows with 'Unleaded', 'N/a', and 'Bi fuel' engine types

In [24]:
data = data[~data['engine'].isin(['Unleaded', 'N/a', 'Bi fuel'])]
data.shape

(66791, 8)

## TRANSMISSION

In [25]:
data['transmission'].unique()

array(['Automatic', 'Manual', 'Semi auto', 'Cvt', 'Semi automatic',
       'Semiauto', 'Unknown', 'Semi-automatic', 'Tr-ew', 'Auto 7 gears',
       'Cvt automa', 'Tr-ga', 'Other', 'Tr-a7', 'Tr-ai', 'Semiautomatic',
       'Auto 10 gears', 'Tr-wa'], dtype=object)

In [26]:
data = data.replace({'transmission' : 
                    {'Semi auto': 'Semiautomatic', 'Semiauto': 'Semiautomatic',
                    'Semi automatic': 'Semiautomatic', 'Manual ': 'Manual',
                    'Semi-automatic': 'Semiautomatic', 'Cvt automa': 'Automatic',
                    'Cvt': 'Automatic', 'Tr-ew': 'Automatic', 'Tr-ga': 'Automatic',
                    'Tr-a7': 'Automatic', 'Tr-ai': 'Automatic', 'Auto 10 gears': 'Automatic',
                    'Tr-wa': 'Automatic', 'Auto 7 gears': 'Automatic'}
                    })
#remove 'Unknown' and 'Other' values
data = data[~data['transmission'].isin(['Unknown', 'Other'])]      
data['transmission'].unique()

array(['Automatic', 'Manual', 'Semiautomatic'], dtype=object)

In [27]:
data.shape

(66779, 8)

Reorder the columns to make the dataframe easy to understand

In [28]:
data = data[['name', 'manufacturer', 'year', 'age', 'kilometerage', 'engine', 'transmission', 'price']]
data.head()

,name,manufacturer,year,age,kilometerage,engine,transmission,price
0,Ford Fiesta,FORD,2003,22,175418,Petrol,Automatic,1500
1,Vauxhall Corsa,VAUXHALL,2003,22,175418,Petrol,Automatic,1500
2,Vauxhall Zafira,VAUXHALL,2003,22,175418,Petrol,Automatic,1500
3,Peugeot 107,PEUGEOT,2003,22,175418,Petrol,Automatic,1500
4,Vauxhall Corsa,VAUXHALL,2003,22,175418,Petrol,Automatic,1500

### Remove insuficeint car models 
Filter the dataframe to keep only names with 10 or more occurrences

In [31]:
# Count the occurrences of each name
name_counts = data['name'].value_counts()
data = data[data['name'].isin(name_counts[name_counts >= 10].index)]
data.shape

(65388, 8)

# Save the Cleand data

In [32]:
#save the cleaned data to a csv file

data.to_csv('../dataSet/cleaned_car_data2.csv', index = False)